12/data/attachments/f704df236ac34c9b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_ccb6364d-4e0a-4708-8176-7131e5e87116</nif:username>
            <nif:friendToBeAdded>Kristopher_prevent_Friend_22982_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>